app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
---
<% booki.comments.each do |comment| %>