app/views/comments/create.js.erb

$(".inputComment").val('');
$(".comment-view").html( "コメント件数：<%= @booki.comments.count %>" );
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]