app/views/comments/destroy.js.erb

$('#comment_area').html("<%= j( render 'comments/comment', booki: @booki ) %>")
$(".comment-view").html( "コメント件数：<%= @booki.comments.count %>" );
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]