app/views/users/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 2]]
---
             <th><%= link_to book.category, search_path(keyword: book.category) %></th>
             <th><p>コメント件数：<%= book.comments.count %></p></th>