app/views/books/show.html.erb

            <th class="comment-view">
                <p>コメント件数：<%= @booki.comments.count %></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 3]]