app/views/homes/search.html.erb

             </th>
             <th><p>コメント数：<%= book.comments.count %></p></th>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 13]]