app/controllers/books_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @books = Book.all.order(params[:sort])
---
SELECT "books".* FROM "books" ORDER BY [#{evaluation} desc]

  def show
    @booki = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "evaluation", "category") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "これ"], ["body", "あああ"], ["user_id", 2], ["created_at", "2021-08-02 03:02:29.146523"], ["updated_at", "2021-08-02 03:02:29.146523"], ["evaluation", 1.5], ["category", "屋根"]]