app/controllers/comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "自分の"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-08-01 09:27:48.781780"], ["updated_at", "2021-08-01 09:27:48.781780"]]
---
  def create

    @booki = Book.find(params[:book_id])
    comment = current_user.comments.new(comment_params)
    comment.book_id = @booki.id
    comment.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
  def destroy
    @booki = Book.find(params[:book_id])
    comment = Comment.find(params[:id])
     #comment = current_user.comments.find_by(id: @booki.id)

    comment.destroy