app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2021-08-01 09:27:39.885412"], ["updated_at", "2021-08-01 09:27:39.885412"]]
---
  def create
    @booki = Book.find(params[:book_id])
    @favorite = current_user.favorites.new(book_id: @booki.id)
    @favorite.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
    @booki = Book.find(params[:book_id])
    @favorite = current_user.favorites.find_by(book_id: @booki.id)
    @favorite.destroy