app/controllers/homes_controller.rb

  def search
    @user = current_user
    @book = Book.new
    @books = Book.search(params[:keyword])
---
SELECT "books".* FROM "books" WHERE (category LIKE 'でしょう')