app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def followings
    user = User.find(params[:user_id])