app/controllers/users_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = @user.books.order(:created_at)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."created_at" ASC  [["user_id", 1]]